[
  {
    "title": "Survey Shows Pent-Up Demand For New Apple iPhones",
    "url": "https://finance.yahoo.com/m/f862527e-fa7e-335a-928f-a6bc54dfc703/survey-shows-pent-up-demand.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 20:27:20 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. A survey of U.S. consumers in March indicates surprisingly strong demand for iPhone upgrades despite \"a challenging fundamental backdrop.\""
  },
  {
    "title": "Sector Update: Tech Stocks Higher in Late Afternoon Trading",
    "url": "https://finance.yahoo.com/news/sector-tech-stocks-higher-afternoon-195452339.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 19:54:52 +0000",
    "full_article_text": "Tech stocks were rising late Tuesday afternoon, with the Technology Select Sector SPDR Fund (XLK) ad"
  },
  {
    "title": "Apple Rebuilds Siri Team With Vision Pro Veterans After Project Setbacks",
    "url": "https://finance.yahoo.com/news/apple-rebuilds-siri-team-vision-193603179.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 19:36:03 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Apple (NASDAQ:AAPL)is overhauling the team behind Siri, with new engineering head Mike Rockwell bringing in fresh leadership from the Vision Pro group, Bloomberg reported. Rockwell, who took over Siri's engineering in a recent executive shuffle, is replacing several key leaders and reorganizing teams that focus on speech, system performance, and user experience. The goal is to revive Siri's capabilities, which have lagged behind rivals like Google (NASDAQ:GOOG) Assistant and OpenAI's ChatGPT. Among the incoming talent is Ranjit Desai, a veteran of the Vision Pro effort, now tasked with leading major parts of Siri's engineering, including its platform and systems teams. Olivier Gutknecht, another Vision Pro executive, will oversee Siri's user experience. Nate Begeman and Tom Duffy, both long-serving Apple engineers, are also joining to strengthen Siri's foundational architecture. Stuart Bowers, who previously managed data and model training, is expanding his role, while longtime Siri leader David Winarsky will lead a new voice and speech group. Rockwell still leads the visionOS platform and reports to Apple's hardware chief John Ternus. The restructuring follows recent setbacks in Siri's development and marks a shift in strategy as Apple aims to catch up in the voice assistant space. This article first appeared onGuruFocus."
  }
]