[
  {
    "title": "Apple (AAPL) Target Slashed to $141: ‘No Easy Answers’ as Trade Tensions and AI Lag Take Toll",
    "url": "https://finance.yahoo.com/news/apple-aapl-target-slashed-141-134436781.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 13:44:36 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. We recently published a list ofTop 10 AI Stocks Making Headlines TodayIn this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other top AI stocks making headlines today. Gratitude is no longer important in the tech world. Although users may be using these words to remain on AI’s good side in the event it takes over, it is costing companies millions of dollars. In the latest news, OpenAI CEO Sam Altman has revealed how showing good manners to a ChatGPT model, such as saying “please” and “thank you,” adds up to millions of dollars in operational expenses. When asked how much the company has lost in electricity costs from people being polite, this is what Altman had to say: “Tens of millions of dollars well spent — you never know.” While that may be so, Kurt Beavers, a director on the design team for Microsoft Copilot, noted how “using polite language sets a tone for the response,” and that when an AI model “clocks politeness, it’s more likely to be polite back.” READ ALSO:Top 10 AI Stocks in the Spotlight This Weekand10 AI Stocks You Shouldn’t Overlook Right Now. Even though politeness may come at a cost for the ChatGPT maker, these may be trivial when it comes to the immense scale at which the company operates itself. The company has recently released its latest artificial intelligence model, claiming that it can “ think with images”. The main new reasoning model from OpenAI is known as the o3, while the smaller model released simultaneously is known as the o4-mini. The o3 allows users to upload whiteboards, sketches, and other images that AI can analyze and discuss. The company is fiercely competing to stay ahead in the artificial intelligence race, facing intense competition from companies such as Google and Anthropic. “For the first time, our reasoning models can independently use all ChatGPT tools — web browsing, Python, image understanding, and image generation. This helps them solve complex, multi-step problems more effectively and take real steps toward acting independently.” O3 and o4-mini are OpenAI’s first AI models that have the ability to “think with images.” This implies that “they don’t just see an image, they can integrate visual information directly into the reasoning chain,” OpenAI noted. For this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Apple Inc. (NASDAQ:AAPL) is a technology company. On April 21, Moffett Nathanson reiterated the stock as “Sell” and cut its price target to $141 per share from $184. “There are no easy answers here. Apple is inextricably tied to opposing forces at the center of the trade tensions. China is the beating heart of the global electronics supply chain. Paying a fortune in tariffs or paying a fortune in re-architecting supply chains only to finish with much higher costs is a lose-lose choice.” According to the firm, Apple is also behind its peer when it comes to monetization from artificial intelligence. Moreover, it is also falling short of fueling a robust upgrade cycle for its premier product, the iPhone. Overall, AAPLranks 6thon our list of top AI stocks making headlines today. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock. READ NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires. Disclosure: None. This article is originally published atInsider Monkey."
  },
  {
    "title": "Cloud AI Update - Tonita Unveils AI Shopping Assistant Transforming E-Commerce Experience",
    "url": "https://finance.yahoo.com/news/cloud-ai-tonita-unveils-ai-123751255.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 12:37:51 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Tonita has launched a new AI-driven shopping assistant that aims to revolutionize the e-commerce experience by allowing users to browse and purchase clothing more intuitively. This AI platform enables conversational searching, offering real-time, personalized product recommendations by interpreting natural language queries. Unlike traditional e-commerce sites, Tonita integrates live product listings from various retailers, providing users with a streamlined shopping process and smart alerts for changes in stock and price. Initially focusing on fashion, the platform plans to expand into other categories, with the goal of making online shopping more efficient and aligned with consumer behaviors. In other market news,DCI Indonesiawas a notable mover up 12% and finishing the session at IDR170,000.00. In the meantime,CoreWeavelagged, down 9.4% to finish the session at $35.42. Microsoft's rapid growth in AI, exceeding $13 billion in annual revenue, highlights strategic urgency. Discover more about Microsoft's AI-driven expansion by exploring our detailed narrative. Additionally, don't miss our previous Market Insights article, where we explored DeepSeek's impact on the AI landscape, highlighting investment shifts and evolving trends—get in fast to stay informed. Applefinished trading at $193.16 down 1.9%. Alphabetended the day at $147.67 down 2.3%. Microsoftended the day at $359.12 down 2.4%, near its 52-week low. Endace announced an integration with Microsoft's Sentinel, enhancing security investigation capabilities through improved access to packet data, just one day ago. Click here to access our complete index of 144Cloud AI Stocks, which featuresNEC,Samsung ElectronicsandNebius Group. Interested In Other Possibilities?We've found 26 US stocks that are forecast to pay a dividend yeild of over 6% next year. See the full list for free. This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Sources: Simply Wall St \"From Fashionistas to Frustrated Shoppers, Tonita Launches AI Assistant for a More Personalized E-Commerce Experience\" from Tonita, Inc. on GlobeNewswire (published 21 April 2025) Companies discussed in this article include IDX:DCIINasdaqGS:AAPLNasdaqGS:GOOGLNasdaqGS:MSFTandNasdaqGS:CRWV. This article was originally published bySimply Wall St. Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com"
  },
  {
    "title": "How to trade the Magnificent 7 amid the market sell-off",
    "url": "https://finance.yahoo.com/video/trade-magnificent-7-amid-market-120021370.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 12:00:21 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. As US stocks (^DJI,^GSPC,^IXIC) sell off, Solidarity Capital CEO Jeff McClean sits down withJosh Liptonto check in on the \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG,GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL). To watch more expert insights and analysis on the latest market action, check out more Asking for a Trendhere. We were talking off camera, Jeff, maybe just broader picture. You see a day like today, I got red everywhere again. Your clients, I'm sure are calling you a lot with a lot of questions. What are they asking you, Jeff? What what what's the big question? What's the big worry? What are you hearing? Yeah, I think a lot of it is is a crash coming. I mean, I literally got text over the weekend with that exact question. And I What did what did you say back? What did what did you say back? No. Like we're already down significantly year to date. Like this has not been a quick uh sudden thing overnight. It's been happening over the past couple weeks of a deterioration. The speed is Yeah, the speed from February 19th to April 7th was dramatic. But I think now the extreme volatility, knock on wood is hopefully behind us and the volatility will stay elevated. The VIX, I think it's going to stay in the 20s for the long foreseeable future here. But I don't see us having extreme 5%, 7%, 9% days, things like that. I think that's going to come down, but the overarching issue is how long does this last? And that's where we get a little nervous. Right. So your clients say, \"Jeff, what's going to come next?\" And you tell them what? I tell them one of two things has to happen. Either consumer and CEO sentiment has to veer from very bearish, like it is right now, to something more neutral or the data is going to catch up to the sentiment and we're going to be led into a recession. Right? If consumers are scared and like they are right now, some of the survey data says it's like 2008, 2009 out there in their minds. Now, that's not on par with reality, but that'll show up in the checkbooks. That'll show up in the spending. And same with CEOs of their indicators towards recession, sky high, right? Of what they're nervous about. So one of those two things have to happen. Sentiment shifts or we are going to have that sentiment lead us into a recession. Right. The CEOs are what gets a lot of headline, a lot of people's attention, right? Because to the extent that a CEO starts to say, \"Listen, I I'm going to just sit on my hands for now. Any any plans I had to invest and spend and hire, I'm going to put that on ice.\" I mean, that is seems to me the big concern. Right. And if they pull back again, like right now it's not showing up in in earnings yet, right? And I don't think it'll show up in earnings for another couple weeks. But if it continues to go on, you're going to see the pull back in CAPEX, which going to have secondary third order effects, whether you're a software company, whether you're equipment provider, whatever it is, it's going to have effects if that doesn't turn. Now, some of this may turn naturally, right? Everyone's we're getting used to Trump again, right? Every tweet, every Truth Social post freaks people out. But I think over time, even though he's going to continue to do it, we'll be a bit more used to it. Yeah. Let me ask you, let's talk about some specific names and groups. I'm sure you must get questions, for example, about the MAG 7. Some of these names have gotten really banged up, right? Do you see opportunity in those names? Are you holding off? How do you think about them? Yeah. Yeah, I think it depends on which MAG 7 we're talking about. Like Apple is still down about 20% year to date. Um at one point it was down 30%. I think Apple, nothing fundamentally changed with their business. I think they're big enough, smart enough to get around the tariff issues where it hurts, obviously, small businesses. But from an Apple perspective, they'll be fine. Google, meta, both are in kind of their own self-created turmoil right now with the anti-trust issues. Yeah. So Uncle Sam has them in their sights. Yeah. I mean, they're at different levels. Like Google already has been found guilty. Now we're just deciding punishment phase, but I'm bullish on Google because we think the parts are worth more than the sum. So if they do get broken apart, YouTube's incredible trillion dollar business. Search, trillion dollar business. AdEx, really big hundred million dollar business. All these things are worth a ton of money. Meta is in a world of hurt, I think, because they don't have any friends right now. The Trump administration is going after them. The last administration was going after them. They don't like them. So anti-trust is inherently political. And so they have problems. And so they have problems. So Alphabet 2, I know you own and hold. Would you be adding here? Correct. Yeah, we're adding incrementally to Alphabet again. Right now, the tenuous nature of what the judgment is going to be is giving us pause from additional adding right now because that's going to hopefully come out here in the next week or two of what the decision there. That'll be appealed, but we need to know what the baseline is. And is the same for So meta, is that on the same the same thing? It's on your watch list, but you're not moving in yet? Yeah, we're a little hesitant on meta. If it wasn't for the trial right now, we'd be all in from a current valuation perspective. Meta is super appealing. Well, that's what I was going to ask you as we were talking about this. I was going to ask you, do you think some of that some of this bad news is priced in at this point? Well, that's what I going to ask you. We were talking about this. I was ask you, do you think some of that some of this bad news is priced in at this point? A little bit, but the uncertainty of exactly what the result is, because how I feel about Google is different how I feel about meta. I think meta needs to be together. If you broke that apart, Instagram here, uh Facebook over here, right? Um WhatsApp over there. I I don't think those work as well together separately as they do together. So I think it'll be interesting if they can sneak out with a fine as like a giant fine, right? As opposed to being broken up. I think that's their best case scenario right now is pay a couple billion dollar fine. Best case, couple billion. Jeff, great to see you always. I appreciate it. Thanks."
  }
]