[
  {
    "title": "This analyst downgraded Amazon ahead of Q1 earnings. Here's why.",
    "url": "https://finance.yahoo.com/video/analyst-downgraded-amazon-ahead-q1-202900722.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 20:29:00 +0000",
    "full_article_text": "Raymond James downgraded Amazon (AMZN) to Outperform from Strong Buy and cut their price target for the stock to $195 from $275, citing tariff headwinds and risks associated with artificial intelligence (AI) spending. The analyst behind the note, Raymond James equity research managing director Josh Beck, joinsJulie Hymanon Market Domination to explain the downgrade. To watch more expert insights and analysis on the latest market action, check out more Market Dominationhere. Raymond James downgraded shares of Amazon from strong buy to outperform, citing risks related to tariff headwinds and massive AI investments. The firm also cut its price target on the stock by nearly 30%. Joining us now, the analyst behind that call, Josh Beck, Raymond James managing director of equity research. Josh, thanks for being here. So, um, we're getting earnings from Amazon shortly here. And so there obviously, there's a lot of scrutiny on tariffs and what the impact is going to be. So, what are you focused on in terms of, I guess let's take the retail side of the business first and sort of the sell through from items that get shipped from China. What's the direct impact there? Yeah, well, well, thanks for having me on. So I think everybody is going through this exercise with the mag 7 and really a lot of tech stocks. Uh what do China tariffs mean to the business? Amazon is certainly an interesting story. In the retail business, there's a couple of different exposures that they have. Uh the first party business is really where they're selling either their own products, Amazon Basics or wholesale agreements with other brands, like Nike, for example. A lot of those goods end up being China sourced. So there's certainly a concern and one of the main reasons that we cut our numbers is you could see inflation on the cogs. And obviously, that pressures gross margins and can pressure operating margins. So I think that's certainly of really high interest to investors. The other one, you know, I spoke with a lot of investors yesterday, is really the third party business. So this is where a smaller seller is effectively using Amazon as a distribution platform. And in this case, you know, the way that it flows through the PNL is really a certain amount of take rate on the amount of sales of that third party seller. So there's been a lot of questions that I've been gathering on, what could Amazon do, maybe to help provide relief to these smaller sellers. Could they offer them a concession on fees? Um, you know, how could they kind of help them remain whole? Because it is really important for Amazon broadly to have high utilization of their massive utilization of their logistics and shipping network. So those are really I think front and center. Advertising as well. Uh many first party and third party sellers advertise on the platform. So within the retail business, those are really the main exposures to keep an eye on. So when you add all of that up, what's your best guess for the potential hit here that we could hear about from Amazon? Yeah, so you know, we ended up taking down our out year. So just to be clear on the timing. So a lot of this is really a second half issue. So obviously the tariffs started to to work their way through in April. You have certainly a freight time from China. You have inventory that you can pre-buy. Probably start to run through that towards the end of Q2. So this is really much more of a second half issue. So what we did is we cut our second half numbers and we cut our 2026 numbers. Our EBIT, which is really what a lot of investors focus on because they do guide to this metric, at least one quarter at a time, by about 12 billion, 12, 13 billion. And as a result, we're about 12% below the street for 2026. So I think a lot of investors feel like the multiple is quite undemanding at this level. Uh it certainly has come down a lot this year. But the biggest question to them is, when have the numbers been derisked? You know, I still feel like the street numbers are too high. So we're waiting for that to happen. I think the main thing investors want to hear on this call is what is Amazon doing to diversify their supply chain and how quickly can they do it and at what cost? So that will really be, I think, the most important item on the call. Right. And for people who are watching, um, they're reporting on May 1st is when that report is due out. So you are not a bear on this stock, to be clear. And so I wanted to get for you to just explain a little bit more to viewers. When you're going to an outperform from a strong buy, what does that mean effectively, if I'm an investor or a potential investor, and I'm trying to figure out what to do with the stock? Yeah, so at Raymond James, we have, you know, a four-tiered rating system. A lot of times it's a three-tiered system. So strong buys are reserved for companies where you see greater than 15% upside and you more or less see things playing out in that direction, um, you know, pretty clearly. In this example, you know, we feel like the multiple is derisked, but we do still see risk to numbers themselves. So what we'd like to see is a message from the company that, right, they are investing. There is probably some further investment cycle that the street needs to think about and see numbers derisk. And then I certainly think it's an interesting long-term story for investors. They have great drivers in terms of what they're doing with AI in their cloud computing business. This is a multi-billion dollar business growing triple digits. Uh it could easily be a five to 10 billion dollar business. So there certainly is a really interesting, I think probably undervalued at the moment, asset in AWS. But we'd like to see things derisk. You know, if we felt like the numbers were more reasonable, I think you could see us maybe revisit the framework. But at the moment, we see a little bit of risk to the numbers next year, so we're kind of looking for that to get right-sized. Got it."
  },
  {
    "title": "Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says",
    "url": "https://finance.yahoo.com/m/94e65c5a-4318-347d-b84d-8731823848ae/cloud-infrastructure-growth.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 20:05:21 +0000",
    "full_article_text": "Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well."
  },
  {
    "title": "Amazon, Netflix, FTAI Aviation, and Tesla Shares Are Soaring, What You Need To Know",
    "url": "https://finance.yahoo.com/news/amazon-netflix-ftai-aviation-tesla-191129919.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 19:11:29 +0000",
    "full_article_text": "A number of stocks jumped in the afternoon session after investor sentiment improved on renewed optimism that the US-China trade conflict might be nearing a resolution. Treasury Secretary Scott Bessent reinforced this positive outlook by describing the trade war as \"unsustainable,\" and emphasized that a potential agreement between the two economic powers \"was possible.\" His comments signaled to markets that both sides might be motivated to seek common ground, raising expectations for reduced tariffs and more stability across markets. The stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Among others, following stocks were impacted: Online Retail company Amazon (NASDAQ:AMZN) jumped 4.9%. Is now the time to buy Amazon?Access our full analysis report here, it’s free. Consumer Subscription company Netflix (NASDAQ:NFLX) jumped 7.6%. Is now the time to buy Netflix?Access our full analysis report here, it’s free. Vehicle Parts Distributors company FTAI Aviation (NASDAQ:FTAI) jumped 5.4%. Is now the time to buy FTAI Aviation?Access our full analysis report here, it’s free. Automobile Manufacturing company Tesla (NASDAQ:TSLA) jumped 6.1%. Is now the time to buy Tesla?Access our full analysis report here, it’s free. Netflix’s shares are not very volatile and have only had 5 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful, although it might not be something that would fundamentally change its perception of the business. The previous big move we wrote about was 7 days ago when the stock gained 5.9% on the news that The Wall Street Journal reported that the company (NFLX) set a lofty goal to reach a $1 trillion market valuation by 2030. In its annual review, Netflix laid out plans to more than double revenue from $39 billion to $80 billion, signaling aggressive growth expectations likely tied to subscriber expansion, content monetization, and international market expansion. Additionally, the company aimed to triple its operating income from $10 billion, reflecting a focus on significantly improving profits, likely through increased operational efficiency and a more disciplined approach to content spending. These targets underscored management's ambitious vision and the confidence in the capacity to pull it off. Netflix is up 17.4% since the beginning of the year, and at $1,040 per share, it is trading close to its 52-week high of $1,059 from February 2025. Investors who bought $1,000 worth of Netflix’s shares 5 years ago would now be looking at an investment worth $2,469. Today’s young investors likely haven’t read the timeless lessons in Gorilla Game: Picking Winners In High Technology because it was written more than 20 years ago when Microsoft and Apple were first establishing their supremacy. But if we apply the same principles, then enterprise software stocks leveraging their own generative AI capabilities may well be the Gorillas of the future. So, in that spirit, we are excited to present our Special Free Report ona profitable, fast-growing enterprise software stock that is already riding the automation wave and looking to catch the generative AI next."
  }
]