[
  {
    "title": "Is Alphabet Inc. (GOOGL) the Cheap Blue Chip Stock to Buy According to Hedge Funds?",
    "url": "https://finance.yahoo.com/news/alphabet-inc-googl-cheap-blue-141611914.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 14:16:11 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. We recently published a list of10 Cheap Blue Chip Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other cheap blue chip stocks to buy according to hedge funds. The broad-based market anxiety increased as the US policy uncertainty rose, says Fidelity. The financial markets were weighed down by tariff hikes, deregulation, and tighter immigration policies. The global business cycle is now less synchronized. As per the investment management firm, the US seemed to show mid- and late-cycle dynamics in Q1 2025. Furthermore, the diversification across fixed income and non-US assets is of utmost importance amid growth risks. While the gold and commodities gained, the US dollar decline fueled the non-US equities, says Fidelity. As per Fidelity, the uncertainty regarding the direction of US policy impacted the financial markets during Q1, with investors digesting the news related to executive actions, such as tariff increases, deregulation announcements, reduced government staffing and programs, and tougher immigration activities. Also, the worries related to the economic effects of the tariff increases on the global economy saw an increase during the days after the quarter closed. Despite elevated growth risks, the global expansion was intact as of the close of Q1. Fidelity opines that diversification in fixed income assets and non-US assets is essential. As per the investment manager, the S&P 500 Index delivered a return of −4.3% for Q1 2025, partly because of the performance of growth stocks (−10%). On the other hand, gold (+19%) and commodities (+8.9%) saw robust gains amid higher market uncertainty. READ ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In. According to Fidelity, the consumer inflation remained rangebound at ~3% during Q1, which was well above the 2% target of the US Fed. The firm anticipates sticky inflation around 3% for the next year, with upside risk resulting from tariff increases. As per the firm, the consumer inflation expectations have increased to multi-decade highs, making it simpler for businesses to pass the increased costs. Coming to the labor, it has remained tight so far, despite increased policy uncertainty, government layoffs, and federal funding cuts, says Fidelity. On the supply side, the broader labor force participation has stalled below the pre-pandemic rate due to slowing immigration as well as demographic constraints. As per Marci McGregor, Head of Portfolio Strategy (Chief Investment Office), Merrill and Bank of America Private Bank, the next few months can be a good time to play defense. The investors can consider defensive, dividend-paying, and value-oriented stocks. For the long term, the investors can position themselves for when the uncertainty around trade decreases. The volatility can provide a chance to buy assets supporting the long-term strategy at attractive prices, says McGregor. To list the 10 Cheap Blue Chip Stocks to Buy According to Hedge Funds, we scanned the holdings of the iShares Core S&P 500 ETF and chose companies that trade at a forward P/E of less than ~20.0x. We also mentioned the hedge fund sentiments around each stock, as of Q4 2024. Finally, the stocks were arranged in ascending order of their hedge fund sentiments. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here). A user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities. Number of Hedge Fund Holders: 234 Forward P/E as of April 18: ~17.04x BofA Securities maintained a “Buy” rating on Alphabet Inc. (NASDAQ:GOOGL)’s stock. The analysts are positive about Google’s recent AI Overviews and its core valuation. They opine that new features are expected to result in increased monetization and more advertising clicks from informational queries. Alphabet Inc. (NASDAQ:GOOGL)’s core search business has been demonstrating resilience and growth. Despite the worries related to the AI disruption, the company’s traditional search business is robust. The company’s AI initiatives go beyond its cloud services. The integration of AI throughout the company’s product suite exhibits its commitment to maintaining a competitive edge in AI technology. Alphabet Inc. (NASDAQ:GOOGL)’s future growth remains tied to the AI initiatives and the AI integration. Its AI infrastructure investments and research place it well to reap the benefits of elevated demand for AI-powered services and cloud computing. AI advancements can fuel Alphabet Inc. (NASDAQ:GOOGL)’s search algorithms, which can help maintain dominance in the search market and potentially increase ad revenue with the help of more precise targeting and improved user experience. Also, GCP’s emphasis on AI and ML capabilities can bring enterprises that are planning to implement advanced AI solutions, potentially fueling market share gains in the broader cloud sector. As Alphabet Inc. (NASDAQ:GOOGL) has been advancing its AI technologies, GCP can benefit from its early access to cutting-edge AI capabilities. Overall, GOOGLranks 1ston our list of cheap blue chip stocks to buy according to hedge funds. While we acknowledge the potential of GOOGL as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for a deeply undervalued AI stock that is more promising than GOOGL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock. READ NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires. Disclosure: None. This article is originally published atInsider Monkey."
  },
  {
    "title": "The Dow bounces back 600 points even as confusion still rules",
    "url": "https://finance.yahoo.com/news/stocks-look-rebound-earnings-roll-122200182.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 13:48:52 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. U.S. stocks opened higher Tuesday aftera brutal start to the week, even as investors remain rattled by a barrage of conflicting signals on recession risks — and by President Donald Trump’sescalating pressure campaign against the Federal Reserve. The Dow Jones Industrial Average rose 603 points in Tuesday morning trading, or 1.6%, while the S&P 500 added 1.5% and the tech-heavy Nasdaq jumped 1.8%. The VIX, Wall Street’s fear gauge, dropped more than 6%, signaling a cooldown in volatility. Gold continued its climb, up 0.7% to $3,449, while small-cap stocks lagged, with the Russell 2000 falling more than 2%. The International Monetary Fund has downgraded its global economic growth forecast for 2025 to 2.8%, a decrease from the previous estimate of 3.3%, citing the impact of widespread tariffs and escalating trade tensions under President Donald Trump’s administration. The U.S. economy is now projected to grow at 1.8%, down from 2.7%, with the IMF raising the probability of a U.S. recession this year to 37%, up from 25%. The IMF attributes the slowdown to increased uncertainty, reduced investment, and tighter credit conditions resulting from the tariffs, which affect nearly 60 countries. Gold extended its historic rally overnight, climbing above $3,500 for the first time. The surge likely reflects a dual concern: Investors are chasing safety amid political and market chaos, while bracing for a potential resurgence in inflation fueled by Trump’s tariffs. Last week, investors poured $8 billion into gold funds — double the peak weekly inflows seen during the pandemic — pushing the four-week average to $4 billion, according to Bank of America Global Research (BAC). Meanwhile, traders onKalshi, a CFTC-regulated prediction market, continue to price in elevated odds of a U.S. recession by the end of 2025. Also on Monday, the U.S. dollar plunged to a three-year low after Trump ramped up attacks on Fed Chair Jerome Powell, intensifying calls for interest rate cuts and deepening fears over the central bank’s independence. “The market no longer knows what to believe,”wroteThe Kobeissi Letter, pointing to a swirl of conflicting cues: gold rising like cuts are coming, stocks falling like a recession is near, and Treasury yields climbing like the economy is booming. Tesla (TSLA) reports earnings after the bell on Tuesday, withWall Street bracing for more bad news. Wells Fargo (WFC) expects a Q1 miss, citing weak deliveries, shrinking margins, and fading enthusiasm for the Cybertruck. The firm also slashed its 2025 outlook by 16%, pointing to soft demand for the refreshed Model Y and mounting doubts around speculative bets like the Cybercab and Optimus. Tesla stock rose more than 3% in Tuesday morning trading after slumping on Monday. The shares are down about 38% so far this year. Shares of Google (GOOGL) parent Alphabet also dropped more than 2% on Monday after the Justice Departmentasked a federal judge to break up the company,possibly by forcing it to sell off its Chrome browser. Google stock rebounded about 1% on Tuesday morning. The wider market rout on Monday saw the Dow tumble almost 1,000 points, or 2.5%, while the S&P 500 dropped 2.4% and the Nasdaq fell 2.6%. The VIX spiked as much as 14% intraday before closing Monday almost 9% higher — a sign that while peak panic cooled, market anxiety remains the order of the day. Beyond Tesla, a wave of major earnings Tuesday will offer a broader pulse check on the industrial and healthcare sectors. Results from Intuitive Surgical (ISRG), Danaher (DHR), and Novartis (NVS) will provide fresh reads on medical tech and pharma trends. SAP (SAP) and Verizon (VZ) add visibility into enterprise tech and telecom, while Chubb’s (CB) results could shed light on how insurers are navigating a climate of rising risk and uncertainty. Defense is also in focus in a big way on Tuesday, with Lockheed Martin (LMT), Northrop Grumman (NOC), and RTX (RTX) (formerly Raytheon Technologies) all reporting earings — offering investors a rare, same-day snapshot of the U.S. military-industrial complex. Together, the three giants cover everything from missile systems to fighter jet engines to battlefield surveillance, making their earnings a bellwether for how rising global tensions and Pentagon budgets are filtering into the sector. Health insurance stocks extended steep losses on Monday after UnitedHealth (UNH) slashed its 2025 forecast, warning of higher-than-expected medical costs across its Medicare Advantage plans. Energy stocks also dropped, dragged down by falling oil prices and growing concerns that a protracted trade war could undercut global demand. For the latest news,Facebook,TwitterandInstagram."
  },
  {
    "title": "Tesla at Risk of a ‘Throwaway Year’ Without a New Narrative From Earnings",
    "url": "https://finance.yahoo.com/news/tesla-risk-throwaway-without-narrative-110309935.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 13:40:14 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. (Bloomberg) -- Tesla Inc. investors reeling from one of the stock’s worst-ever quarters are once again looking for Elon Musk to inject excitement back into the company when it reports results Tuesday, as profits slip and the much-awaited debut of a self-driving car remains months away. Most Read from Bloomberg DOGE Visits National Gallery of Art to Discuss Museum’s Legal Status Trump Gives New York ‘One Last Chance’ to End Congestion Fee Trump Administration Takes Over New York Penn Station Revamp The Racial Wealth Gap Is Not Just About Money This year is off to a dismal start as Musk’s political entanglements have pushed Tesla’s sales to a nearly three-year low in the first three months, leading a slew of Wall Street analysts to slash their growth expectations. The automaker’s souring outlook and towering valuation has spooked investors, leading to a 53% plunge in Tesla’s stock price since it hit a record in December. “Musk needs to bring the voltage on this earnings call to get the stock out of stall speed,” said Dave Mazza, chief executive officer of Roundhill Investments, who owns the stock. “Tesla’s stock is stuck in an information air pocket as Elon Musk focused on his DOGE work, while their car sales skid and political headwinds build in important markets.” Shoring up investor confidence will largely depend on whether Musk starts to step away from his involvement with the Trump administration and the Department of Government Efficiency. When reports this month suggested that such a move might be in the offing, shares of the company rallied, shrugging off weak sales number. Beyond that, investors are looking for details on planned launch of the self-driving vehicle later this summer, and details on any new models at a time when competition from other electric vehicles is ramping up globally. Tesla shares were up 2.1% by 9:33 a.m. in New York on Tuesday. Earnings for the first quarter are expected to fall from the prior-year level and revenue is estimated to stay flat when the company reports results after markets close on Tuesday, according to data compiled by Bloomberg. Analysts have been dialing back their estimates sharply over the past month, with profit expectations falling by about 12% and revenue forecasts down over 6%. “The takeaway for most will likely be that 2025 is a throwaway year,” said Gene Munster, co-founder at Deepwater Asset Management. However, Munster also expects this to be the year that “sets the stage for a major rebound in 2026 and beyond.” Tesla shares have slumped this year with concerns swirling about the damage that Musk’s political activities have done to the company’s brand — and sales — adding to wider investor anxiety about economic growth and US trade policy. The 36% drop in the share price from January through March was the third-largest quarterly decline since the company’s 2010 public listing. Despite the steep selloff, the stock continues to command a high valuation. Tesla shares trade at 78 times forward earnings, compared to the S&P 500 Index’s average of 19, as of Monday’s close. The mega-cap technology companies, often referred to as the Magnificent Seven, are widely seen as the company’s true peers rather than traditional carmakers such as General Motors Co. and Ford Motor Co., and they trade at a much lower average valuation of 23. “Any report from Tesla matters less than what the future holds, since most of the value in the stock is based on the future,” said Eric Schiffer, chief executive officer of Los Angeles-based private equity firm Patriarch Organization. “Of all of the Mag-7 stocks, it is Tesla whose valuation is almost entirely about the future.” Schiffer and other bullish Tesla investors point to the potential that Tesla’s self-driving technology will allow it to establish a dominant position over rivals such as Alphabet Inc.’s Waymo. The first real test of that promise will come in a few months when the company is slated to launch its robotaxi service in Austin in June. Still, many investors and analysts remain worried about the slowing pace of the company’s core electric-car making business, which brought in 90% of its revenue last year. Apart from an overall slowdown in EV adoption, a production pause and the brand damage from Musk’s political involvement, the company’s stale product lineup is also hurting sales. Many fans are awaiting the announcement of new, more affordable vehicles that could compete with lower-cost competitors like China’s BYD Co. On that front, there were discouraging news reports over the past weekend suggesting that Tesla is pushing back the production of its lower-cost Model Y by at least three months. The initial plan was to roll out the car in the first half of the year. “Tesla faces questions on increasingly weaker fundamentals,” said Dan Levy, analyst at Barclays, noting that the company’s profit margin from the core auto business is expected to reach a new low, and after a soft start it may be increasingly difficult to see sales volume rising this year. Still, Levy said, “a potential source of upside for Tesla stock could be a re-engaged Elon Musk,” adding that a “good narrative could outweigh weak fundamentals.” Why Tesla Is Losing Ground Around the World: QuickTake Top Tech Stories Beijing Smart Walnut Education Technology Co., a provider of services that help children learn to code, is one of several Chinese firms considering initial public offerings in the US despite market turmoil and friction between Washington and Beijing, according to people familiar with the matter. An intensifying rivalry between JD.com Inc. and Meituan in China’s food delivery space is dealing a blow to their share prices, as investors worry about the hit to profitability. A group of Roblox users is re-creating real life school shooting incidents on the gaming platform that’s popular with kids, including attacks at Columbine High School and the Robb Elementary School in Uvalde, Texas. Uber Technologies Inc. was sued by the US Federal Trade Commission, which claims the rideshare and delivery company hurt consumers through “deceptive billing and cancellation practices” as part of its flagship subscription service. Earnings Due Tuesday Earnings Premarket: Verizon Communications (VZ) Earnings Postmarket: Manhattan Associates Inc. (MANH US) Pegasystems Inc. (PEGA US) --With assistance from Subrat Patnaik. (Adds current stock move in sixth paragraph.) Most Read from Bloomberg Businessweek Why US Men Think College Isn’t Worth It Anymore The Guy Who Connected Donald Trump to the Manosphere Eight Charts Show Men Are Falling Behind, From Classrooms to Careers How Mar-a-Lago Memberships Explain Trump’s Tariff Obsession Why Brunello Cucinelli Is Well Suited for a Trade War ©2025 Bloomberg L.P."
  }
]