[
  {
    "title": "The Dow soars 1,000 points as markets hang on hope for a China trade deal",
    "url": "https://finance.yahoo.com/news/stocks-look-rebound-earnings-roll-122200182.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 20:10:00 +0000",
    "full_article_text": "U.S. stocks rallied Tuesday, capping off a dramatic comeback fueled by hopes of easing trade tensions and a softer stance on tariffs. The Dow surged 1,017 points, or 2.7%, while the S&P 500 jumped 2.5% and the Nasdaq soared 2.7%. The Russell 2000 outpaced them all, up nearly 2.8%, signaling broad-based enthusiasm — at least for now. Volatility retreated, with the VIX dropping over 9%, and investors rotated out of safe havens. After rising to fresh highs overnight, gold fell 1.2% to $3,383 an ounce, snapping a record-setting streak even as JPMorgan (JPM) analysts said they still see a path to $4,000 an ounce in the months ahead. Meanwhile, Bitcoin popped 5% to break above $90,000 for the first time since March, with some traders viewing crypto as a hedge against ongoing policy whiplash. Not all stocks participated in the rally. Defense contractors took a hit after earnings reports showed margin compression and rising tariff risks. Northrop Grumman plunged 12.5% — the worst performer in the S&P 500 — after reporting a steep drop in profit tied to cost overruns on the B-21 bomber program. RTX slid over 9% after warning that tariffs could slash up to $850 million from its 2025 profits. The rest of the market took a more optimistic view. Tesla gained almost 5% ahead of earnings, Netflix (NFLX) jumped over 5%, and GE Aerospace (GE) rallied 6% following a strong report. Still, with Treasury Secretary Scott Bessent scheduled to speak Wednesday on the financial system — and the political backdrop still wildly unpredictable — few believe today’s rally settles the score. Stocks climbed on Tuesday after U.S. Treasury Secretary Scott Bessentreportedly tolda private gathering that the ongoing trade war with China is “unsustainable” and likely to “de-escalate.” The S&P 500 and Nasdaq rose just over 2% by late afternoon, buoyed by optimism over potential relief from steep tariffs that have weighed on global markets. However, analysts caution that the rally may be premature. Despite Bessent’s comments, there have been no formal negotiations between the U.S. and China to date, and much of social media greeted these latest deal hints withskepticism. The Trump administration’s recent tariff hikes remain in effect, including a baseline 10% tariff on all imports and additional levies pushing some Chinese goods to a 145% tariff rate. The International Monetary Fund has also weighed in, warning that the current tariff policies have delivered a significant negative shock to the global economy, prompting a downgrade in growth forecasts. While the market’s reaction reflects hope for a resolution, the situation underscores the volatility and uncertainty that continue to characterize U.S.-China trade relations. U.S. stocks rebounded strongly Tuesday aftera brutal start to the week, even as investors remain rattled by a barrage of conflicting signals on recession risks — and by President Donald Trump’sescalating pressure campaign against the Federal Reserve. The Dow Jones Industrial Average rose 1,035 points, or 2.7%, while the S&P 500 also added 2.7% and the tech-heavy Nasdaq jumped 3%. The VIX, Wall Street’s fear gauge, dropped almost 10%, signaling a cooldown in volatility.Gold continued its climb, up 0.4% to $3,439. The International Monetary Funddowngraded its global economic growth forecastfor 2025 to 2.8%, a decrease from the previous estimate of 3.3%, citing the impact of widespread tariffs and escalating trade tensions under President Donald Trump. The U.S. economy is now projected to grow at 1.8%, down from 2.7%, with theIMF raising the probabilityof a U.S. recession this year to 37%, up from 25%. The IMF attributes the slowdown to increased uncertainty, reduced investment, and tighter credit conditions resulting from the tariffs, which affect nearly 60 countries. Gold extended its historic rally overnight, climbing above $3,500 for the first time. The surge likely reflects a dual concern: Investors are chasing safety amid political and market chaos, while bracing for a potential resurgence in inflation fueled by Trump’s tariffs. Last week, investors poured $8 billion into gold funds — double the peak weekly inflows seen during the pandemic — pushing the four-week average to $4 billion, according to Bank of America Global Research (BAC). Meanwhile, traders onKalshi, a CFTC-regulated prediction market, continue to price in elevated odds of a U.S. recession by the end of 2025. Also on Monday, the U.S. dollar plunged to a three-year low after Trump ramped up attacks on Fed Chair Jerome Powell, intensifying calls for interest rate cuts and deepening fears over the central bank’s independence. “The market no longer knows what to believe,”wroteThe Kobeissi Letter, pointing to a swirl of conflicting cues: gold rising like cuts are coming, stocks falling like a recession is near, and Treasury yields climbing like the economy is booming. Tesla (TSLA) reports earnings after the bell on Tuesday, withWall Street bracing for more bad news. Wells Fargo (WFC) expects a Q1 miss, citing weak deliveries, shrinking margins, and fading enthusiasm for the Cybertruck. The firm also slashed its 2025 outlook by 16%, pointing to soft demand for the refreshed Model Y and mounting doubts around speculative bets like the Cybercab and Optimus. Tesla stock rose more than 6% in Tuesday afternoon trading after slumping on Monday. Its shares are down about 36% so far this year. Shares of Google (GOOGL) parent Alphabet rose 3% Tuesday. The stock had slipped more than 2% on Monday after the Justice Departmentasked a federal judge to break up the company,possibly by forcing it to sell off its Chrome browser. Beyond Tesla, a wave of major earnings Tuesday will offer a broader pulse check on the industrial and healthcare sectors. Results from Intuitive Surgical (ISRG), Danaher (DHR), and Novartis (NVS) will provide fresh reads on medical tech and pharma trends. SAP (SAP) and Verizon (VZ) add visibility into enterprise tech and telecom, while Chubb’s (CB) results could shed light on how insurers are navigating a climate of rising risk and uncertainty. Defense is also in focus in a big way on Tuesday, with Lockheed Martin (LMT), Northrop Grumman (NOC), and RTX (RTX) (formerly Raytheon Technologies) all reporting earings — offering investors a rare, same-day snapshot of the U.S. military-industrial complex. Together, the three giants cover everything from missile systems to fighter jet engines to battlefield surveillance, making their earnings a bellwether for how rising global tensions and Pentagon budgets are filtering into the sector. For the latest news,Facebook,TwitterandInstagram."
  },
  {
    "title": "Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says",
    "url": "https://finance.yahoo.com/m/94e65c5a-4318-347d-b84d-8731823848ae/cloud-infrastructure-growth.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 20:05:21 +0000",
    "full_article_text": "Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well."
  },
  {
    "title": "Market Chatter: Google Turned Down Opportunity to Add Search Engine to OpenAI Chatbot",
    "url": "https://finance.yahoo.com/news/market-chatter-google-turned-down-195901621.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 19:59:01 +0000",
    "full_article_text": "Alphabet's (GOOG) Google last year turned down an offer by OpenAI to include its search engine as pa"
  }
]