[
  {
    "title": "ChatGPT Chief Calls Search Crucial for OpenAI in Google Trial",
    "url": "https://finance.yahoo.com/news/chatgpt-chief-calls-search-crucial-180344015.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 18:03:44 +0000",
    "full_article_text": "(Bloomberg) -- OpenAI’s goals of building a “super assistant” app and reaching general artificial intelligence won’t succeed without search technology but Google has declined to work with the startup, the head of its ChatGPT product testified Tuesday in the Google antitrust trial. Most Read from Bloomberg Trump Gives New York ‘One Last Chance’ to End Congestion Fee DOGE Visits National Gallery of Art to Discuss Museum’s Legal Status Trump Administration Takes Over New York Penn Station Revamp The Racial Wealth Gap Is Not Just About Money OpenAI’s Nick Turley said the company never intended to simply create a chatbot like its popular ChatGPT, and instead wanted to deliver a “super assistant” that can help users complete tasks. But the large language models that underlie the company’s chatbot have inherent limitations because of a lack of recent information and their tendency to hallucinate, or invent false answers to questions when they don’t know the answer. That’s where search capability becomes essential, he said. “Search technology is a necessary component,” Turley testified in Washington federal court as part of the Justice Department’s antitrust case against Alphabet Inc.’s Google. “You can’t have a super assistant that doesn’t know the current facts or makes things up.” OpenAI’s ChatGPT, launched to the public in November 2022, was initially viewed internally as a research project. The company didn’t expect the app would become one of the most viral software products of all time, ushering in a new wave of AI investment and consumer frenzy. Since launching ChatGPT, OpenAI has started bringing more assistant-like functionality into its products, such as the ability to search the web, write code, and do complex research, as well as a tool called “Operator,” that can do tasks such as book a restaurant reservation on a user’s behalf. “We are not trying to recreate the type of experience you find on Google with 10 blue links and ads,” he said. Turley was called by the Justice Department to testify as part of a three-week trial aimed at determining what changes Google must make to its business after a federal judge found last year that the company monopolized the search market. Judge Amit Mehta is set to decide by August what business practices Google must modify. Microsoft Corp. has poured more than $13 billion into a partnership with OpenAI, tapping the startup’s generative-AI technology to enhance its Bing search service, Edge internet browser and, most notably, integrate an AI Copilot service into Windows. In turn, the startup uses Microsoft’s Azure cloud servers and has access to Bing’s search information. During his testimony, Turley never directly talked about Microsoft, instead referring to a relationship with “Provider No. 1.” Turley said that OpenAI had “significant quality issues” with the search information from that provider. “It became clear over time that it was not viable to depend on” another company in the long run, he said. “It was at best a near-term solution.” In early 2024, OpenAI began to build out its own search index, he said. Turley set a goal of having ChatGPT rely on OpenAI’s own search index 80% of the time by the end of this year. That was overly ambitious, he acknowledged in his testimony, and he estimated that it will take several more years. Part of the difficulty is websites that limit OpenAI’s web crawler, he said. “Google can outspend us or offer more traffic to these partners than we can,” Turley said. “They have way more queries every single day.” In August, OpenAI reached out to Google about whether they could reach an agreement to gain access to the search giant’s index, Turley said. Google provides some access to Meta Platforms Inc. for its AI products, Turley said, a partnership Meta Chief Executive Officer Mark Zuckerberg has spoken about publicly. Google never responded to OpenAI in writing, he said, but declined in verbal conversations. The testimony is significant because Turley said OpenAI sought to work with Google’s search engine but was turned down. The Justice Department’s proposed remedy for Google’s monopolization of the market would require Google to share its search index with rivals to help them improve their products after the search giant’s years of monopolization. Turley said that having that access would accelerate OpenAI’s plans. “Having access to the data that underlies Google’s index, the content or signals, would accelerate the development of our own index,” he said. Most Read from Bloomberg Businessweek As More Women Lift Weights, Gyms Might Never Be the Same Why US Men Think College Isn’t Worth It Anymore Eight Charts Show Men Are Falling Behind, From Classrooms to Careers The Guy Who Connected Donald Trump to the Manosphere How Mar-a-Lago Memberships Explain Trump’s Tariff Obsession ©2025 Bloomberg L.P."
  },
  {
    "title": "Meta Platforms, Inc. (META): Among Stocks That Could 10X Over the Next 2 Years",
    "url": "https://finance.yahoo.com/news/meta-platforms-inc-meta-among-174200222.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 17:42:00 +0000",
    "full_article_text": "We recently published a list of9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other stocks that could 10X over the next 2 years. While tariffs from the US government disrupted international trade, they also led to uncertainty and turbulence in financial markets, with the  S&P 500 closing below 5,000 points for the first time in nearly a year. An analysis from the World Economic Forum regarding how tariffs cause volatility in financial markets was stated in the words of Santiago Fernández de Lis, Head of Regulation, BBVA, as follows: “The main impact of trade tensions on global markets is through uncertainty. When major economies—like the US and China—engage in a tariff war, investors fear slower global trade, disrupted supply chains and weakened corporate profits. This anxiety translates into market volatility. Companies delay investment decisions, consumers lose confidence, and currencies fluctuate wildly.” However, global markets rebounded later as the US president made an announcement of a 90-day pause on additional higher tariffs that had to impact almost 80 countries, with the exception of China. In the case of China, the new president is convinced to keep high tariffs as he stated that these tariffs would be increased to 125% from 104% following China’s announcement of additional retaliatory tariffs against the US. Following this pause in tariffs, Wall Street witnessed a sigh of relief. The S&P 500 rose 9.52%, thereby marking its biggest one-day gain since 2008. The Dow Jones Industrial Average climbed almost 7.87%  to close at 40,608.45. Simultaneously, the tech-heavy Nasdaq soared 12.2% and had its best day since January 2001. To compile our list of the 9 stocks that could 10X over the next 2 years, we first carried out a consensus by sifting through multiple similar articles online. Once we had an extended list of the stocks that could 10X over the next 2 years, we shortlisted the top 9 stocks based on the number of hedge funds that have stakes in them, as of Q4 2024. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here). A team of developers working in unison to create the company's messaging application. Number of Hedge Fund Holders:262 Meta Platforms, Inc. (NASDAQ:META) builds the future of human connection and the technology that makes it possible. The firm has two reportable segments, the ‘Family of Apps’, including Facebook, Instagram, Messenger, WhatsApp, and other services, and the ‘Reality Labs’, which includes its virtual, augmented, and mixed reality-related consumer hardware, software, and content. Although analysts believe in the company’s long-term growth potential and AI tailwinds, several price targets for the stock have been cut down considering the current macro uncertainties. Amid concerns about the firm’s performance in the second quarter and beyond, potentially impacted by the tariffs, TD Cowen analysts reduced the price target on the stock to $725 from $785 while keeping a Buy rating. However, the analysts anticipate solid Q1 2025 results, with total revenue near the upper end of management’s guidance and advertising revenue expected to rise approximately 17% year-over-year (foreign exchange impacts excluded). Simultaneously, Morgan Stanley analyst Brian Nowak lowered the price target to $615 from $660 while maintaining an Overweight rating on the stock, taking into account macroeconomic factors as well as tariff challenges impacting e-commerce and digital advertising sectors. Morgan Stanley has reduced estimates for its North American internet stock coverage across the board. Overall, METAranks 1ston our list of stocks that could 10X over the next 2 years. As we acknowledge the growth potential of META, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock. READ NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires. Disclosure: None. This article is originally published atInsider Monkey."
  },
  {
    "title": "Instagram’s Systrom Says Zuckerberg Saw App’s Growth as ‘Threat’",
    "url": "https://finance.yahoo.com/news/instagram-co-founder-claims-app-163459481.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 17:10:33 +0000",
    "full_article_text": "(Bloomberg) -- Instagram co-founder Kevin Systrom testified that his fledgling photo-sharing app could have succeeded without being acquired by Meta Platforms Inc., and that eventually Chief Executive Officer Mark Zuckerberg treated Instagram’s growth as a “threat” and starved it of resources. Most Read from Bloomberg Trump Gives New York ‘One Last Chance’ to End Congestion Fee DOGE Visits National Gallery of Art to Discuss Museum’s Legal Status Trump Administration Takes Over New York Penn Station Revamp The Racial Wealth Gap Is Not Just About Money The claims could bolster the US government’s monopoly case against the social networking giant as it argues to unwind the 2012 acquisition. In testimony Tuesday during Meta’s antitrust trial in Washington, Systrom recounted how quickly Instagram was growing before Zuckerberg’s offer. “The users, they just kept coming,” Systrom recalled from the stand under questioning by US Federal Trade Commission lawyer Bob Zuver. FTC lawyers displayed a chart of Instagram’s growth before the acquisition that showed registered users increased 13-fold in 2011, the year before the deal. Systrom said that he believed Instagram was capable of launching several important features, including support for videos and private messages, even if the company hadn’t been acquired by Meta, then called Facebook Inc. He said that Instagram didn’t need infrastructure help — it used Amazon Web Services to keep the site operational — and the startup could have successfully combated spam and other harmful content as a standalone company. “We would have been able to scale our problematic content screening fairly well,” he said. “It wasn’t rocket science.” Systrom said that Zuckerberg was hot and cold on Instagram over the time that he worked there, and grew to view Instagram as a “threat” to his own social network, Facebook. Systrom said that Instagram rarely got the resources that he requested, including headcount for company-wide initiatives like video and integrity efforts around data privacy. Following the Cambridge Analytica privacy scandal, Systrom says Instagram got no new headcount despite a broad effort to shore up Meta’s data practices. “I thought that that was not appropriate given the scale of Instagram,” he said. FTC lawyers also showed emails from Systrom where he was frustrated about Meta’s investment in Instagram. In one to former Chief Technology Officer Mike Schroepfer, Systrom wrote that “we also have areas that are ‘starving’” for investment. In another email to Instagram leaders in 2017, Systrom complained that Instagram got no new headcount despite a wide investment to grow the company’s video ambitions. “We were given zero of 300 incremental video heads, which is an unacceptable and offensive outcome,” Systrom wrote. On the stand, Systrom acknowledged that all teams fight for resources and headcount, but that given Instagram’s role in driving revenue and growth for the company he felt offended by the lack of support. “I was working very hard for the company to make this a success and not getting resources back,” he said. “It was in stark contrast to the effort I was putting in.” Lawyers for the FTC are seeking to prove that by purchasing Instagram in 2012, and WhatsApp in 2014, Meta created an illegal social networking monopoly, and the agency wants US District Judge James Boasberg to undo those deals. After agreeing to sell his company for $1 billion, Systrom continued to run it within Facebook until 2018. Lawyers for the FTC have sought to establish that Instagram was an up-and-coming rival to Meta that would have been a formidable competitor had it stayed independent. During the trial’s first week, the FTC displayed dozens of internal emails from Zuckerberg and other top executives fretting over Instagram’s rapid growth and superior photo products. Meta, meanwhile, has argued that Instagram became a massive success thanks in large part to the support it provided the photo app following the acquisition. “When we acquired Instagram, it had about 2% of the users it has today, just 13 employees, no revenue, and virtually no infrastructure of its own,” Meta’s General Counsel Jennifer Newstead wrote in a blog post earlier this month before the trial started. “Many of the features that are now central to the Instagram community – direct messaging, live video streaming, shopping, and stories – were built on Meta’s core technology infrastructure after the acquisition.” Roelof Botha, an early Instagram investor from Sequoia Capital, suggested during a video deposition that was played Monday in court that Instagram benefited from Meta’s data centers and other technical infrastructure. He pointed out that several other photo-sharing apps from that time — including a few that Sequoia also invested in — ultimately failed. On the stand Tuesday, Systrom also acknowledged that Facebook was a helpful tool in helping the app grow before the acquisition since many users also posted their Instagram photos to their Facebook account. At the time, Instagram users were also encouraged to share their photos to other social networks, including Twitter — an option that shut off shortly after the acquisition. Meta’s lawyers will have a chance to cross-examine Systrom after the FTC is finished. Systrom said that Zuckerberg eventually shut off certain support for Instagram inside the Facebook app — things like notifications that would send people to Instagram. “He believed we were hurting Facebook’s growth,” Systrom said, adding that Zuckerberg believed that slowing Instagram’s growth would simultaneously slow Facebook’s decline. When asked whether Zuckerberg was ultimately happy to have Instagram as part of the company, Systrom said it was “a complex question.” “He was always very happy to have Instagram in the family because it was growing so quickly and we did great product work,” Systrom said. “But also I think as the founder of Facebook he felt a lot of emotion around which one was better, meaning Instagram or Facebook.” (Updates with Zuckerberg feeling threatened in final paragraph.) Most Read from Bloomberg Businessweek As More Women Lift Weights, Gyms Might Never Be the Same Why US Men Think College Isn’t Worth It Anymore Eight Charts Show Men Are Falling Behind, From Classrooms to Careers The Guy Who Connected Donald Trump to the Manosphere How Mar-a-Lago Memberships Explain Trump’s Tariff Obsession ©2025 Bloomberg L.P."
  }
]