[
  {
    "title": "Should You Buy Alphabet Stock Before April 24?",
    "url": "https://www.fool.com/investing/2025/04/22/should-you-buy-alphabet-stock-before-april-24/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=acdd6db2-13be-444a-a65c-d125ad796a79&.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 13:30:00 +0000",
    "full_article_text": "You're reading a free article with opinions that may differ\n       from The Motley Fool's Premium Investing Services. Become a Motley Fool member today toget instant access to our top analyst recommendations, in-depth research, investing resources,and more.Learn More Key Points Alphabet reports earnings on April 24, and there are a lot of important things investors should be on the lookout for. Over the next few weeks, many companies are scheduled to report earnings for the first calendar quarter of 2025. For the technology sector, perhaps no other companies are as important as the \"Magnificent Seven\" --Nvidia,Apple,Microsoft,Amazon,Meta Platforms,Tesla, andAlphabet(GOOGL1.50%)(GOOG1.50%). These businesses have unlocked new forms of monetization over the last few years thanks in large part to investments in artificial intelligence (AI). Alphabet has been a major beneficiary of the AI movement, integrating the technology across its ecosystem from advertising, cloud computing, cybersecurity, and more. With the company slated to report earnings later this week on April 24, you might think scooping up shares in Alphabet now is a no-brainer. However, there are a number of items that investors should digest before buying Alphabet stock right now. Let's take a look at some recent developments surrounding the company to help assess if Alphabet is a good stock to buy before the company reports earnings this week. Alphabet is the parent company to internet search giant Google and video-sharing website YouTube. For many years, the global reach of both of these platforms provided Alphabet with unparalleled surface area on the internet. Hence, advertisers paid top dollar to get in front of Google's and YouTube's audiences. Over the last few years, however, the competitive landscape has started to shift in the advertising realm. The rising popularity oflarge language models(LLMs) such as ChatGPT has disrupted the default option of Googling something online. Don't get me wrong, Google is still a massively popular search engine. But just the idea that Google could lose its appeal with some demographics could lead to major repercussions pertaining to Alphabet being the de facto platform for advertisers. On top of that, Amazon has quietly struck some notable partnerships in the advertising space with social media companiesPinterestandSnap. Although both of these deals are fairly nascent, I think Amazon's integration with Pinterest and Snapchat could bode particularly well with younger demographics, who tend to resort to online marketplaces as opposed to brick-and-mortar outlets. As a result,Amazon's budding ads businessposes another potential road bump to Alphabet's growth. Lastly, Alphabet has been under some intense scrutiny in recent years from the Justice Department. In particular, some judges perceive Google as an illegal monopoly in theadvertising technologyspace. Without getting into the weeds of the various rulings, my high-level concern is that Alphabet could be distracted with appeals and lawsuits for the foreseeable future as it pertains to its ads business, which already appears to be under pressure from alternative platforms. Image source: Getty Images. For the last few years, AI has served as a growth driver for Alphabet. The company has integrated a number of AI-powered services across its ecosystem, in particular cloud infrastructure and cybersecurity. In my eyes, the long-term growth that AI presents was a driving factor supporting Alphabet's decision to acquire cybersecurity start-upWizearlier this year. Right now, however, there is one possible hiccup that could deter Alphabet's AI growth for the time being. Of course, I'm talking about President Donald Trump's newtariffs. While software is not a product that is imported or exported, it's not completely immune to tariffs either. These tariff policies are likely going to require businesses to operate under tighter cost controls for the time being. As a result, some businesses may choose to slow down spend in high-dollar areas such as expensive AI tools or cybersecurity protocols. While I tend to think software platforms will exhibit some degree of resiliency during this murky economic period, investors should listen to management's words carefully during the earnings call as it pertains to what Alphabet is seeing from its AI customers from a demand perspective. Shares of Alphabet appear to be trading at a significant discount compared to historical valuations based on theforward price-to-earnings(P/E) ratio. On the surface, the attractive valuation could tempt investors tobuy the dipin Alphabet without hesitation.  GOOGL PE Ratio (Forward)data byYCharts With that said, I think there are quite a few unknowns surrounding Alphabet's prospects right now. Between the advertising ruling, rising competition, and a cloudy picture around major sources of growth such as AI and cybersecurity, I think investors are best off waiting on the sidelines and digesting the earnings call later this week before buying shares. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors.Adam Spataccohas positions in Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Pinterest, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has adisclosure policy. Stocks Mentioned *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles"
  },
  {
    "title": "Microsoft Corporation (MSFT) Price Target Lowered to $472 Amid Demand Concerns, AI Outlook Remains Strong",
    "url": "https://finance.yahoo.com/news/microsoft-corporation-msft-price-target-131043353.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 13:10:43 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. We recently compiled a list of the12 AI Stocks on Wall Street's Radar.In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against the other AI stocks on Wall Street's radar. Almost 50 House Democrats have signed a message to stop the unauthorized use of AI tools in the government. Members of Congress have asked to cease applying any unauthorized artificial intelligence system that will aid in curbing government spending. President Donald Trump has set up DOGE, or the Department of Government Efficiency. Meanwhile, billionaire Elon Musk has been assigned the responsibility to cut what DOGE will say is waste, fraud, and abuse in the federal bureaucracy. READ NOW:10 AI Stocks You Shouldn’t Overlook Right Nowand10 AI Stocks to Watch Amid Market Volatility. The Democrats have acknowledged that artificial intelligence holds the potential to modernize the US government. However, it also highlighted the potential concerns related to employee monitoring and access to sensitive data by DOGE and its AI tools. \"These present serious security risks, self-dealing, and potential criminal liability if not handled correctly, and have the potential to undermine successful and appropriate AI adoption,\" The Democrats have further demanded that the administration terminate the use of any AI systems that haven’t been formally approved through processes such as FedRAMP or that have been unable to meet existing legal requirements. The letter, addressed to the White House Office of Management and Budget, was also questioned on whether any of the technology used by the administration was powered by Musk’s company, xAI. This question, in particular, has been asked to clarify any potential conflicts of interest. According to the Democrats, these would be \"exponentially worse if Musk pursues further contracts to become a major provider of government AI services.\" The White House has recently introduced new policies on federal agency AI use and the federal government. “President Trump recognizes that AI is a technology that will define the future. This administration is focused on encouraging and promoting American AI innovation and global leadership, which starts with utilizing these emerging technologies within the Federal Government. Today’s revised memos offer much needed guidance on AI adoption and procurement that will remove unnecessary bureaucratic restrictions, allow agencies to be more efficient and cost-effective, and support a competitive American AI marketplace.” For this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (see more details here). A development team working together to create the next version of Windows. Number of Hedge Fund Holders: 317 Microsoft Corporation (NASDAQ:MSFT) provides AI-powered cloud, productivity, and business solutions, focusing on efficiency, security, and AI advancements. Morgan Stanley reiterated the stock as “Overweight” and lowered its price target to $472 per share from $530. The analysts noted how there is a “wall of worry” due to macro and micro demand impacts, leaving negative investor sentiment. “Even post our proactive cuts to our estimates, the valuation looks attractive at 25X GAAP CY26 EPS, for a long-term GenAI winner.” Overall MSFTranks 2ndon our list of the AI stocks on Wall Street's radar. While we acknowledge the potential of MSFT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock.  READ NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires.  Disclosure: None. This article is originally published atInsider Monkey."
  },
  {
    "title": "Cloud AI Update - Tonita Unveils AI Shopping Assistant Transforming E-Commerce Experience",
    "url": "https://finance.yahoo.com/news/cloud-ai-tonita-unveils-ai-123751255.html?.tsrc=rss",
    "source": "Yahoo Finance",
    "date": "Tue, 22 Apr 2025 12:37:51 +0000",
    "full_article_text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Tonita has launched a new AI-driven shopping assistant that aims to revolutionize the e-commerce experience by allowing users to browse and purchase clothing more intuitively. This AI platform enables conversational searching, offering real-time, personalized product recommendations by interpreting natural language queries. Unlike traditional e-commerce sites, Tonita integrates live product listings from various retailers, providing users with a streamlined shopping process and smart alerts for changes in stock and price. Initially focusing on fashion, the platform plans to expand into other categories, with the goal of making online shopping more efficient and aligned with consumer behaviors. In other market news,DCI Indonesiawas a notable mover up 12% and finishing the session at IDR170,000.00. In the meantime,CoreWeavelagged, down 9.4% to finish the session at $35.42. Microsoft's rapid growth in AI, exceeding $13 billion in annual revenue, highlights strategic urgency. Discover more about Microsoft's AI-driven expansion by exploring our detailed narrative. Additionally, don't miss our previous Market Insights article, where we explored DeepSeek's impact on the AI landscape, highlighting investment shifts and evolving trends—get in fast to stay informed. Applefinished trading at $193.16 down 1.9%. Alphabetended the day at $147.67 down 2.3%. Microsoftended the day at $359.12 down 2.4%, near its 52-week low. Endace announced an integration with Microsoft's Sentinel, enhancing security investigation capabilities through improved access to packet data, just one day ago. Click here to access our complete index of 144Cloud AI Stocks, which featuresNEC,Samsung ElectronicsandNebius Group. Interested In Other Possibilities?We've found 26 US stocks that are forecast to pay a dividend yeild of over 6% next year. See the full list for free. This article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Sources: Simply Wall St \"From Fashionistas to Frustrated Shoppers, Tonita Launches AI Assistant for a More Personalized E-Commerce Experience\" from Tonita, Inc. on GlobeNewswire (published 21 April 2025) Companies discussed in this article include IDX:DCIINasdaqGS:AAPLNasdaqGS:GOOGLNasdaqGS:MSFTandNasdaqGS:CRWV. This article was originally published bySimply Wall St. Have feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com"
  }
]