[
  {
    "title": "Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says",
    "url": "https://finance.yahoo.com/m/94e65c5a-4318-347d-b84d-8731823848ae/cloud-infrastructure-growth.html?.tsrc=rss",
    "date": "Tue, 22 Apr 2025 20:05:21 +0000",
    "key_sentences": "Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well. Unlock stock picks and a broker-level newsfeed that powers Wall Street.",
    "named_entities": {
      "ORG": [
        "Amazon"
      ]
    },
    "keywords": [
      "Wall Street",
      "powers Wall",
      "broker-level newsfeed",
      "Unlock stock",
      "Street",
      "Wall",
      "stock picks",
      "Unlock",
      "Amazon stock",
      "stock"
    ],
    "condensed_text": "Title: Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says\n\nKey information: Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well. Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nNamed entities:\n- ORG: Amazon\nKeywords: Wall Street, powers Wall, broker-level newsfeed, Unlock stock, Street, Wall, stock picks, Unlock, Amazon stock, stock\n",
    "summary": "\n- Amazon stock has been hit by fears about tariffs and e-commerce\n- Analysts are warning about cloud risks as well\n- Title: Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says\n\nKey information: Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well\n"
  },
  {
    "title": "Market Chatter: Google Turned Down Opportunity to Add Search Engine to OpenAI Chatbot",
    "url": "https://finance.yahoo.com/news/market-chatter-google-turned-down-195901621.html?.tsrc=rss",
    "date": "Tue, 22 Apr 2025 19:59:01 +0000",
    "key_sentences": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. Alphabet's (GOOG) Google last year turned down an offer by OpenAI to include its search engine as pa",
    "named_entities": {
      "ORG": [
        "Alphabet's",
        "OpenAI"
      ],
      "DATE": [
        "last year"
      ]
    },
    "keywords": [
      "Wall Street",
      "powers Wall",
      "Unlock stock",
      "Street",
      "GOOG",
      "stock picks",
      "broker-level newsfeed",
      "Wall",
      "Alphabet",
      "Unlock"
    ],
    "condensed_text": "Title: Market Chatter: Google Turned Down Opportunity to Add Search Engine to OpenAI Chatbot\n\nKey information: Unlock stock picks and a broker-level newsfeed that powers Wall Street. Alphabet's (GOOG) Google last year turned down an offer by OpenAI to include its search engine as pa\n\nNamed entities:\n- ORG: Alphabet's, OpenAI\n- DATE: last year\nKeywords: Wall Street, powers Wall, Unlock stock, Street, GOOG, stock picks, broker-level newsfeed, Wall, Alphabet, Unlock\n",
    "summary": "\n- Alphabet's (GOOG) Google last year turned down an offer by OpenAI to include its search engine as a feature\n- Positive market sentiment surrounding MSFT\n- Favorable industry trends benefiting MSFT\n"
  },
  {
    "title": "CoreWeave Stock Gets a Wave of Buy Ratings. But No One Is Denying the Risk.",
    "url": "https://finance.yahoo.com/m/d515e52e-3b33-3491-9487-6d6c89bd5e0f/coreweave-stock-gets-a-wave.html?.tsrc=rss",
    "date": "Tue, 22 Apr 2025 19:31:00 +0000",
    "key_sentences": "Analysts are bullish from here but acknowledge plenty of risk in CoreWeave’s rapid growth. Unlock stock picks and a broker-level newsfeed that powers Wall Street. CoreWeave stock has been on a wild ride since its March IPO.",
    "named_entities": {
      "DATE": [
        "March"
      ],
      "ORG": [
        "CoreWeave"
      ]
    },
    "keywords": [
      "Wall Street",
      "powers Wall",
      "March IPO",
      "broker-level newsfeed",
      "Street",
      "Unlock stock",
      "Wall",
      "stock picks",
      "Unlock",
      "IPO"
    ],
    "condensed_text": "Title: CoreWeave Stock Gets a Wave of Buy Ratings. But No One Is Denying the Risk.\n\nKey information: Analysts are bullish from here but acknowledge plenty of risk in CoreWeave’s rapid growth. Unlock stock picks and a broker-level newsfeed that powers Wall Street. CoreWeave stock has been on a wild ride since its March IPO.\n\nNamed entities:\n- DATE: March\n- ORG: CoreWeave\nKeywords: Wall Street, powers Wall, March IPO, broker-level newsfeed, Street, Unlock stock, Wall, stock picks, Unlock, IPO\n",
    "summary": "\n- CoreWeave stock has been on a wild ride since its March IPO\n- Analysts are bullish from here but acknowledge plenty of risk\n- Key information: Analysts are bullish from here but acknowledge plenty of risk in CoreWeave’s rapid growth\n"
  }
]